app/controllers/commands_controller.rb

SELECT "commands".* FROM "commands"
---
  def index
    @commands = Command.all

INSERT INTO "commands" ("code", "action", "command", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["code", "10000010"], ["action", 5], ["command", "Hello world"], ["status", 0], ["created_at", "2018-10-09 02:09:52.306923"], ["updated_at", "2018-10-09 02:09:52.306923"]]
---
  def create
    @command = Command.new(command_params)

    respond_to do |format|
      if @command.save

SELECT  "commands".* FROM "commands" WHERE "commands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_command
      @command = Command.find(params[:id])