app/controllers/control_controller.rb

SELECT "devices".* FROM "devices"
---
  def index
    @devices = Device.all

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "statuses".* FROM "statuses" WHERE "statuses"."device_id" = $1  [["device_id", 8]]
---
  def get_device
    device = Device.includes(:status).find_by(id: params[:id])

INSERT INTO "commands" ("device_id", "code", "action", "command", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["device_id", 8], ["code", "00000001"], ["action", 6], ["command", "{\"ID\":\"00000001\",\"Action\":6}"], ["created_at", "2018-10-23 16:05:22.885708"], ["updated_at", "2018-10-23 16:05:22.885708"]]
---
  def create_command
    cmd = Command.create(device_id: params[:device_id], code: params[:code], action: params[:action_type], command: params[:command])