app/controllers/devices_controller.rb

SELECT "devices".* FROM "devices"
---
  def index
    @devices = Device.all

INSERT INTO "devices" ("code", "unit_id", "is_active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["code", "0000001"], ["unit_id", 1], ["is_active", true], ["created_at", "2018-10-04 15:50:25.855959"], ["updated_at", "2018-10-04 15:50:25.855959"]]
---
  def create
    @device = Device.new(device_params)

    respond_to do |format|
      if @device.save

SELECT  "devices".* FROM "devices" WHERE "devices"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_device
      @device = Device.find(params[:id])