app/controllers/home_controller.rb

SELECT "devices".* FROM "devices" INNER JOIN "statuses" ON "statuses"."device_id" = "devices"."id" ORDER BY "devices"."id" ASC
---
  def index
    @devices = Device.joins(:status).order(:id)