app/controllers/units_controller.rb

SELECT "units".* FROM "units"
---
  def index
    @units = Unit.all

INSERT INTO "units" ("unit_code", "name", "address", "description", "is_active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @unit = Unit.new(unit_params)

    respond_to do |format|
      if @unit.save

SELECT  "units".* FROM "units" WHERE "units"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_unit
      @unit = Unit.find(params[:id])